package com.ktc.guaxiang;

public class Utils {

	public static String[] bagua = { "坤", "震", "坎", "兑", "艮", "离", "巽", "乾" };

	public static String[][] guaxiang = {
			{ "坤", "复", "师", "临", "谦", "明夷", "升", "泰" },
			{ "豫", "震", "解", "归妹", "小过", "丰", "恒", "大壮" },
			{ "比", "屯", "坎", "节", "蹇", "既济", "井", "需" },
			{ "萃", "随", "困", "兑", "咸", "革", "大过", "夬" },
			{ "剥", "颐", "蒙", "损", "艮", "贲", "蛊", "大畜" },
			{ "晋", "噬嗑", "未济", "睽", "旅", "离","鼎", "大有" },
			{ "观", "益", "涣", "中孚", "渐", "家人", "巽", "小畜" },
			{ "否", "无妄", "讼", "履", "遁", "同人", "姤", "乾" } };
}
